
from .models import Receipt

recipes = [
    {
        "title": "Картофель по-деревенски",
        "ingredients_list": [
            ('Картофель', 500, 400, 50, 30),
            ('Масло растительное', 50, 50, 20, 0),
            ('Чеснок', 20, 15, 10, 5),
            ('Розмарин', 5, 5, 15, 0),
            ('Соль', 10, 10, 5, 0),
            ('Перец черный', 5, 5, 10, 0),
        ]
    },
    {
        "title": "Индейка запеченная",
        "ingredients_list": [
            ('Индейка', 2000, 1600, 500, 120),
            ('Масло сливочное', 100, 80, 80, 0),
            ('Чеснок', 30, 25, 15, 5),
            ('Розмарин', 10, 10, 20, 0),
            ('Тимьян', 10, 10, 20, 0),
            ('Соль', 20, 20, 10, 0),
            ('Перец черный', 10, 10, 15, 0),
        ]
    }
]

recipes = [Receipt(recipe["title"], recipe["ingredients_list"]) for recipe in recipes]
